; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	image0 - mode
	image1 - mode
	spectrograph2 - mode
	GroundStation2 - direction
	Star3 - direction
	Star1 - direction
	GroundStation0 - direction
	Star4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph2)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 145)
	(supports instrument2 image1)
	(calibration_target instrument2 Star1)
	(supports instrument3 image1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph2)
	(supports instrument4 image1)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 139)
	(supports instrument5 spectrograph2)
	(supports instrument5 image0)
	(calibration_target instrument5 Star1)
	(supports instrument6 spectrograph2)
	(supports instrument6 image1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 193)
	(= (data Star4 image0) 65)
	(= (data Phenomenon5 image0) 244)
	(= (data Star6 image0) 173)
	(= (data Phenomenon7 image0) 201)
	(= (data Phenomenon8 image0) 273)
	(= (data Star4 image1) 43)
	(= (data Phenomenon5 image1) 100)
	(= (data Star6 image1) 138)
	(= (data Phenomenon7 image1) 14)
	(= (data Phenomenon8 image1) 185)
	(= (data Star4 spectrograph2) 34)
	(= (data Phenomenon5 spectrograph2) 41)
	(= (data Star6 spectrograph2) 254)
	(= (data Phenomenon7 spectrograph2) 5)
	(= (data Phenomenon8 spectrograph2) 57)
	(= (slew_time GroundStation2 GroundStation0) 67.85)
	(= (slew_time GroundStation0 GroundStation2) 67.85)
	(= (slew_time GroundStation2 Star1) 39.07)
	(= (slew_time Star1 GroundStation2) 39.07)
	(= (slew_time Star3 GroundStation0) 27.76)
	(= (slew_time GroundStation0 Star3) 27.76)
	(= (slew_time Star3 Star1) 7.855)
	(= (slew_time Star1 Star3) 7.855)
	(= (slew_time Star3 GroundStation2) 63.11)
	(= (slew_time GroundStation2 Star3) 63.11)
	(= (slew_time Star1 GroundStation0) 36)
	(= (slew_time GroundStation0 Star1) 36)
	(= (slew_time Star4 GroundStation0) 32.21)
	(= (slew_time GroundStation0 Star4) 32.21)
	(= (slew_time Star4 Star1) 9.802)
	(= (slew_time Star1 Star4) 9.802)
	(= (slew_time Star4 GroundStation2) 80.68)
	(= (slew_time GroundStation2 Star4) 80.68)
	(= (slew_time Star4 Star3) 3.114)
	(= (slew_time Star3 Star4) 3.114)
	(= (slew_time Phenomenon5 GroundStation0) 82.76)
	(= (slew_time GroundStation0 Phenomenon5) 82.76)
	(= (slew_time Phenomenon5 Star1) 0.4998)
	(= (slew_time Star1 Phenomenon5) 0.4998)
	(= (slew_time Phenomenon5 GroundStation2) 71.07)
	(= (slew_time GroundStation2 Phenomenon5) 71.07)
	(= (slew_time Phenomenon5 Star3) 14.49)
	(= (slew_time Star3 Phenomenon5) 14.49)
	(= (slew_time Phenomenon5 Star4) 71.28)
	(= (slew_time Star4 Phenomenon5) 71.28)
	(= (slew_time Star6 GroundStation0) 9.361)
	(= (slew_time GroundStation0 Star6) 9.361)
	(= (slew_time Star6 Star1) 25.96)
	(= (slew_time Star1 Star6) 25.96)
	(= (slew_time Star6 GroundStation2) 43)
	(= (slew_time GroundStation2 Star6) 43)
	(= (slew_time Star6 Star3) 48.04)
	(= (slew_time Star3 Star6) 48.04)
	(= (slew_time Star6 Star4) 9.977)
	(= (slew_time Star4 Star6) 9.977)
	(= (slew_time Star6 Phenomenon5) 1.371)
	(= (slew_time Phenomenon5 Star6) 1.371)
	(= (slew_time Phenomenon7 GroundStation0) 3.507)
	(= (slew_time GroundStation0 Phenomenon7) 3.507)
	(= (slew_time Phenomenon7 Star1) 30.4)
	(= (slew_time Star1 Phenomenon7) 30.4)
	(= (slew_time Phenomenon7 GroundStation2) 4.493)
	(= (slew_time GroundStation2 Phenomenon7) 4.493)
	(= (slew_time Phenomenon7 Star3) 61.79)
	(= (slew_time Star3 Phenomenon7) 61.79)
	(= (slew_time Phenomenon7 Star4) 37.27)
	(= (slew_time Star4 Phenomenon7) 37.27)
	(= (slew_time Phenomenon7 Phenomenon5) 39.27)
	(= (slew_time Phenomenon5 Phenomenon7) 39.27)
	(= (slew_time Phenomenon7 Star6) 0.6235)
	(= (slew_time Star6 Phenomenon7) 0.6235)
	(= (slew_time Phenomenon8 GroundStation0) 49.51)
	(= (slew_time GroundStation0 Phenomenon8) 49.51)
	(= (slew_time Phenomenon8 Star1) 56.78)
	(= (slew_time Star1 Phenomenon8) 56.78)
	(= (slew_time Phenomenon8 GroundStation2) 16.29)
	(= (slew_time GroundStation2 Phenomenon8) 16.29)
	(= (slew_time Phenomenon8 Star3) 31.76)
	(= (slew_time Star3 Phenomenon8) 31.76)
	(= (slew_time Phenomenon8 Star4) 19.24)
	(= (slew_time Star4 Phenomenon8) 19.24)
	(= (slew_time Phenomenon8 Phenomenon5) 24.42)
	(= (slew_time Phenomenon5 Phenomenon8) 24.42)
	(= (slew_time Phenomenon8 Star6) 1.463)
	(= (slew_time Star6 Phenomenon8) 1.463)
	(= (slew_time Phenomenon8 Phenomenon7) 29.53)
	(= (slew_time Phenomenon7 Phenomenon8) 29.53)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Phenomenon5 image0)
	(have_image Star6 image0)
	(have_image Phenomenon7 spectrograph2)
	(have_image Phenomenon8 image1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 phenomenon5 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 193 to 153.73, (fuel-used) from 0 to 39.27
   goals met: 0 of 5
2. (turn_to satellite2 star1 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star1)
   changed: (fuel satellite2) from 153.73 to 153.23, (fuel-used) from 39.27 to 39.7698
   goals met: 0 of 5
3. (turn_to satellite2 groundstation0 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 153.23 to 117.23, (fuel-used) from 39.7698 to 75.7698
   goals met: 0 of 5
4. (turn_to satellite0 phenomenon5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 145 to 120.58, (fuel-used) from 75.7698 to 100.19
   goals met: 0 of 5
5. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
6. (turn_to satellite0 star1 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 120.58 to 120.08, (fuel-used) from 100.19 to 100.69
   goals met: 0 of 5
7. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 5
8. (turn_to satellite0 phenomenon5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 120.08 to 119.58, (fuel-used) from 100.69 to 101.189
   goals met: 0 of 5
9. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 5
10. (calibrate satellite2 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 0 of 5
11. (turn_to satellite2 phenomenon7 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 117.23 to 113.723, (fuel-used) from 101.189 to 104.696
   goals met: 0 of 5
12. (turn_to satellite2 star6 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star6)
   changed: (fuel satellite2) from 113.723 to 113.1, (fuel-used) from 104.696 to 105.32
   goals met: 0 of 5
13. (take_image satellite0 phenomenon5 instrument0 image0)
   added: (have_image phenomenon5 image0)
   changed: (data_capacity satellite0) from 1000 to 756, (data-stored) from 0 to 244
   goals met: 1 of 5
14. (turn_to satellite0 star6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 119.58 to 118.209, (fuel-used) from 105.32 to 106.691
   goals met: 2 of 5
15. (turn_to satellite2 phenomenon8 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 113.1 to 111.637, (fuel-used) from 106.691 to 108.154
   goals met: 2 of 5
16. (take_image satellite2 phenomenon8 instrument6 image1)
   added: (have_image phenomenon8 image1)
   changed: (data_capacity satellite2) from 1000 to 815, (data-stored) from 244 to 429
   goals met: 3 of 5
17. (turn_to satellite2 phenomenon7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 111.637 to 82.1067, (fuel-used) from 108.154 to 137.684
   goals met: 3 of 5
18. (take_image satellite0 star6 instrument0 image0)
   added: (have_image star6 image0)
   changed: (data_capacity satellite0) from 756 to 583, (data-stored) from 429 to 602
   goals met: 4 of 5
19. (take_image satellite2 phenomenon7 instrument6 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   changed: (data_capacity satellite2) from 815 to 810, (data-stored) from 602 to 607
   goals met: 5 of 5
